ryood/PSoC_5LP_DigitalFilter_Test/Filter_ADC_VDAC_poll_CQ_PSoC5LP_DDS.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>Timer</name>
      <description>No description available</description>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>Timer_GLOBAL_ENABLE</name>
          <description>PM.ACT.CFG</description>
          <addressOffset>0x400043A3</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>en_timer</name>
              <description>Enable timer/counters.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Timer_CONTROL</name>
          <description>TMRx.CFG0</description>
          <addressOffset>0x40004F00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enables timer/comparator.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Mode. (0 = Timer; 1 = Comparator)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Timer</name>
                  <description>Timer mode. CNT/CMP register holds timer count value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Comparator</name>
                  <description>Comparator mode. CNT/CMP register holds comparator threshold value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONESHOT</name>
              <description>Timer stops upon reaching stop condition defined by TMR_CFG bits. Can be restarted by asserting TIMER RESET or disabling and re-enabling block.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP_BUFF</name>
              <description>Buffer compare register. Compare register updates only on timer terminal count.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INV</name>
              <description>Invert sense of TIMEREN signal</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DB</name>
              <description>Deadband mode--Deadband phases phi1 and phi2 are outputted on CMP and TC output pins respectively.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Timer</name>
                  <description>CMP and TC are output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Deadband</name>
                  <description>PHI1 (instead of CMP) and PHI2 (instead of TC) are output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEADBAND_PERIOD</name>
              <description>Deadband Period</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Timer_CONTROL2</name>
          <description>TMRx.CFG1</description>
          <addressOffset>0x40004F01</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>IRQ_SEL</name>
              <description>Irq selection. (0 = raw interrupts; 1 = status register interrupts)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FTC</name>
              <description>First Terminal Count (FTC). Setting this bit forces a single pulse on the TC pin when first enabled.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable_FTC</name>
                  <description>Disable the single cycle pulse, which signifies the timer is starting.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable_FTC</name>
                  <description>Enable the single cycle pulse, which signifies the timer is starting.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCOR</name>
              <description>Disable Clear on Read (DCOR) of Status Register SR0.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBMODE</name>
              <description>Deadband mode (asynchronous/synchronous). CMP output pin is also affected when not in deadband mode (CFG0.DEADBAND).</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_BUS_EN_SEL</name>
              <description>Digital Global Clock selection.</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BUS_CLK_SEL</name>
              <description>Bus Clock selection.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Timer_CONTROL3_</name>
          <description>TMRx.CFG2</description>
          <addressOffset>0x40004F02</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TMR_CFG</name>
              <description>Timer configuration (MODE = 0): 000 = Continuous; 001 = Pulsewidth; 010 = Period; 011 = Stop on IRQ</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Continuous</name>
                  <description>Timer runs while EN bit of CFG0 register is set to '1'.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pulsewidth</name>
                  <description>Timer runs from positive to negative edge of TIMEREN.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Period</name>
                  <description>Timer runs from positive to positive edge of TIMEREN.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Irq</name>
                  <description>Timer runs until IRQ.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COD</name>
              <description>Clear On Disable (COD). Clears or gates outputs to zero.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ROD</name>
              <description>Reset On Disable (ROD). Resets internal state of output logic</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CMP_CFG</name>
              <description>Comparator configurations</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Equal</name>
                  <description>Compare Equal </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Less_than</name>
                  <description>Compare Less Than </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Less_than_or_equal</name>
                  <description>Compare Less Than or Equal .</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Greater</name>
                  <description>Compare Greater Than .</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Greater_than_or_equal</name>
                  <description>Compare Greater Than or Equal </description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HW_EN</name>
              <description>When set Timer Enable controls counting.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Timer_PERIOD</name>
          <description>TMRx.PER0 - Assigned Period</description>
          <addressOffset>0x40004F04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
        <register>
          <name>Timer_COUNTER</name>
          <description>TMRx.CNT_CMP0 - Current Down Counter Value</description>
          <addressOffset>0x40004F06</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
        </register>
