ryood/PSoC_5LP_DigitalFilter_Test/Filter_ADC_VDAC_poll_CQ_PSoC5LP_DDS.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VDAC8_1</name>
      <description>No description available</description>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VDAC8_PM_ACT_CFG</name>
          <description>Active Power Mode Configuration Register 8</description>
          <addressOffset>0x400043A8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>en_dac</name>
              <description>Enable DAC block(s). Populated subsystems are counted from the LSB</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDAC8_PM_STBY_CFG</name>
          <description>Standby Power Mode Configuration Register 8</description>
          <addressOffset>0x400043B8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>en_dac</name>
              <description>Enable DAC block(s). Populated subsystems are counted from the LSB</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDAC8_TR</name>
          <description>VDAC8_TR</description>
          <addressOffset>0x4000460A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>tr</name>
              <description>8 Calibration bits</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VDAC8_CR0</name>
          <description>DAC Block Control Register 0</description>
          <addressOffset>0x40005828</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>mode</name>
              <description>Mode Bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC_MODE_V</name>
                  <description>voltage DAC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_MODE_I</name>
                  <description>current DAC</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>range</name>
              <description>Ranges for mode=0 (VDAC) and mode=1 (IDAC)</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC_RANGE_0</name>
                  <description>x0=0V to 4*vref (1.024V); 0 to 31.875uA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_RANGE_1</name>
                  <description>x1=0V to 16*vref (4.096V); 0 to 255uA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_RANGE_2</name>
                  <description>x0=0V to 4*vref (1.024V); 0 to 2.040mA</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_RANGE_3</name>
                  <description>x1=0V to 16*vref (4.096V); not used</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>hs</name>
              <description>High Speed Bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DAC_HS_LOWPOWER</name>
                  <description>regular (low power)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC_HS_HIGHSPEED</name>
                  <description>high speed (higher power)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VDAC8_CR1</name>
          <description>DAC Block Control Register 1</description>
          <addressOffset>0x40005829</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>mx_data</name>
              <description>Select DATA source</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MX_DATA_REG</name>
                  <description>Select register source (DACxn_D)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_DATA_UDB</name>
                  <description>Select UDB source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>mx_idir</name>
              <description>Mux selection for DAC current direction control</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MX_IDIR_REG</name>
                  <description>Register source idirbit selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_IDIR_UDB</name>
                  <description>UDB ictrl selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>mx_ioff</name>
              <description>Mux selection for DAC current off control</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MX_IOFF_REG</name>
                  <description>Register source ioffbit selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_IOFF_UDB</name>
                  <description>UDB ictrl selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>reset_udb_en</name>
              <description>DAC reset enable</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET_UDB_EN_DISABLE</name>
                  <description>Disable DAC Reset Source from UDB (System reset always resets)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_UDB_EN_ENABLE</name>
                  <description>Enable DAC Reset Source from UDB</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VDAC8_SW0</name>
          <description>DAC Analog Routing Register 0</description>
          <addressOffset>0x40005A90</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>v_ag1</name>
              <description>Connect voltage output to analog global of same side</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AG_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AG_CONNECTED</name>
                  <description>Connect to Analog Global</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>v_ag0</name>
              <description>Connect voltage output to analog global of same side</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AG_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AG_CONNECTED</name>
                  <description>Connect to Analog Global</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VDAC8_SW2</name>
          <description>DAC Analog Routing Register 2</description>
          <addressOffset>0x40005A92</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>v_abus3</name>
              <description>Connect voltage output to analog (local) bus of the same side </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABUS_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABUS_CONNECTED</name>
                  <description>Connect to Analog (local) Bus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>v_abus1</name>
              <description>Connect voltage output to analog (local) bus of the same side </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABUS_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABUS_CONNECTED</name>
                  <description>Connect to Analog (local) Bus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VDAC8_SW3</name>
          <description>DAC Analog Routing Register 3</description>
          <addressOffset>0x40005A93</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>iout</name>
              <description>Connect current output to pad</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOUT_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOUT_CONNECT</name>
                  <description>Connect to pad</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>i_amx</name>
              <description>Connect current output to Analog Mux Bus</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AMX_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AMX_CONNECTED</name>
                  <description>Connect to AMUXBUS</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>v_amx</name>
              <description>Connect voltage output to Analog Mux Bus</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AMX_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AMX_CONNECTED</name>
                  <description>Connect to AMUXBUS</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VDAC8_SW4</name>
          <description>DAC Analog Routing Register 4</description>
          <addressOffset>0x40005A94</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>i_ag1</name>
              <description>Connect current output to analog global of same side</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AG_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AG_CONNECTED</name>
                  <description>Connect to Analog Global</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>i_ag0</name>
              <description>Connect current output to analog global of same side</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AG_NC</name>
                  <description>not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AG_CONNECTED</name>
                  <description>Connect to Analog Global</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VDAC8_STROBE</name>
          <description>DAC Strobe Register</description>
          <addressOffset>0x40005A97</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>mx_strobe</name>
              <description>Strobe source selection</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MX_STROBE_BUSWRITE</name>
                  <description>Select bus write strobe source (Enable gater regardless of strobe_en setting)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_STROBE_UDB_SRC</name>
                  <description>Select UDB strobe source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_STROBE_NC_2</name>
                  <description>NC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_STROBE_NC_3</name>
                  <description>NC</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_STROBE_CLK_A0_DIG</name>
                  <description>Select clk_a0_dig</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_STROBE_CLK_A1_DIG</name>
                  <description>Select clk_a1_dig</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_STROBE_CLK_A2_DIG</name>
                  <description>Select clk_a2_dig</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MX_STROBE_CLK_A3_DIG</name>
                  <description>Select clk_a3_dig</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>strobe_en</name>
              <description>Strobe gating control (See mx_strobe==3'h0)</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STROBE_EN_0</name>
                  <description>disable strobe</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STROBE_EN_1</name>
                  <description>enable strobe</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VDAC8_DATA</name>
          <description>DAC Data Register</description>
          <addressOffset>0x40005B82</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>data</name>
              <description>8 DAC Data bits</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
