ryood/PSoC_5LP_DigitalFilter_Test/Filter_ADC_VDAC_poll_CQ_PSoC5LP_DDS.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>Filter</name>
      <description>No description available</description>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>Filter_DFB_PM_ACT_CFG_Register</name>
          <description>Active Mode Power Control Register</description>
          <addressOffset>0x400043A6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>en_dfb</name>
              <description>Enable DFB(s). Populated subsystems are counted from the LSB.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable_dfb</name>
                  <description>Enable Power to DFB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disable_dfb</name>
                  <description>Disable Power to DFB</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_DFB_PM_STBY_CFG_Register</name>
          <description>Alternate Active Mode Power Control Register</description>
          <addressOffset>0x400043B6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>en_dfb</name>
              <description>Enable DFB(s). Populated subsystems are counted from the LSB.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable_dfb</name>
                  <description>Enable Power to DFB during standby power mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disable_dfb</name>
                  <description>Disable Power to DFB</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_Control_Register</name>
          <description>DFB Control Register</description>
          <addressOffset>0x4000C780</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CORECLK_DISABLE</name>
              <description>This bit when set high disables (gates off) the clock to the entire core of the block. This includes all FFs except those used for the AHB interface and CSRs and all 6 RAMs. When disabled (set high) the AHB interface to the CSR is still fully functional. This bit is ANDed with the primary input signal dfb_clk_en to control the clock gate. dfb_clk_en must be high and CoreCLK_Disable must be low for the clock to run.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CORECLK_DISABLE_LOW</name>
                  <description>Core Clock is Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORECLK_DISABLE_HIGH</name>
                  <description>Core Clock is Disabled (gated)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADD6</name>
              <description>This bit is literally address bit 5 (6th bit) of the FSM RAM when addressed by the DFB Controller. It has no affect on the FSM RAM when addressed on the AHB interface. It controls the Banking feature of the FSM.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR6_LOW</name>
                  <description>ADDR6 is Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR6_HIGH</name>
                  <description>ADDR6 is HIGH</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUN</name>
              <description>Setting this bit to 1 enables the DFB to run. Setting it to 0 forces the next state address of the FSM to zero of the active Bank, reinitializes the ACU's and PC's and clears the round flag, saturation flag, saturation detect flag and all 6 extended Enables in the Controller.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN_DIS</name>
                  <description>DFB operation is halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_EN</name>
                  <description>DFB is enabled to operate.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_Status_Register</name>
          <description>DFB Status Register</description>
          <addressOffset>0x4000C784</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>INTR_SEM2</name>
              <description>If this bit is high, semaphore register bit 2 is a source of the current interrupt. Write a '1' to this bit to clear it.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEM2_OFF</name>
                  <description>Indicates no pending Semaphore 2 Interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEM2_ON</name>
                  <description>Indicates a pending Semaphore 2 Interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTR_SEM1</name>
              <description>If this bit is high, semaphore register bit 1 is a source of the current interrupt. Write a '1' to this bit to clear it.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEM1_OFF</name>
                  <description>Indicates no pending Semaphore 1 Interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEM1_ON</name>
                  <description>Indicates a pending Semaphore 1 Interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTR_SEM0</name>
              <description>If this bit is high, semaphore register bit 0 is a source of the current interrupt. Write a '1' to this bit to clear it.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEM0_OFF</name>
                  <description>Indicates no pending Semaphore 0 Interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEM0_ON</name>
                  <description>Indicates a pending Semaphore 0 Interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTR_HOLDB</name>
              <description>If this bit is high, Holding register B is a source of the current interrupt. Write a '1' to this bit to clear it. Reading the Holding register B also clears this bit.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HOLDB_OFF</name>
                  <description>Indicates no pending Holding B Register Interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLDB_ON</name>
                  <description>Indicates a pending Holding B Register Interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTR_HOLDA</name>
              <description>If this bit is high, Holding register A is a source of the current interrupt. Write a '1' to this bit to clear it. Reading the Holding register A also clears this bit.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HOLDA_OFF</name>
                  <description>Indicates no pending Holding A Register Interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLDA_ON</name>
                  <description>Indicates a pending Holding A Register Interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RND_MODE</name>
              <description>Indicates that the DP is in Round mode - meaning that any result passing out of the DP unit is being rounded to a 16-bit value.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RND_OFF</name>
                  <description>Indicates Round Mode is off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RND_ON</name>
                  <description>Indicates Round Mode is on.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAT_MODE</name>
              <description>Indicates that the DP unit is in Saturation mode.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAT_OFF</name>
                  <description>Indicates Saturation mode is off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAT_ON</name>
                  <description>Indicates Saturation mode is on.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_SEL</name>
              <description>This bit indicates which Control Store memory is in use, RAM A or RAM B.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAMSEL_LOW</name>
                  <description>Control Store memory A is in use.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAMSEL_HIGH</name>
                  <description>Control Store memory B is in use.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_DFB_RAM_EN_Register</name>
          <description>DFB Ram Enable Register</description>
          <addressOffset>0x4000C788</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAMWR_ADDRING</name>
              <description>These two bits control the write addressing of the 4 largest RAMs embedded in the DFB (CS-A, CS-B, Data-A, Data-B). The setting of these bits allows overlaid writes to occur to these memories when it is desired to fill them with like data.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_OVERLAY</name>
                  <description>No overlay mapping.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERLAY_CS_A_CS_B</name>
                  <description>Overlay CS A with CS B.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERLAY_DATA_A_DATA_B</name>
                  <description>Overlay Data A with Data B.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERLAY_CS_AB_DATA_AB</name>
                  <description>Overlay CS A/B with Data A with DATA B.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPB_EN</name>
              <description>Datapath RAM B RAM enable / disable.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_DIS</name>
                  <description>RAM is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_EN</name>
                  <description>RAM is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPA_EN</name>
              <description>Datapath RAM A RAM enable / disable.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_DIS</name>
                  <description>RAM is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_EN</name>
                  <description>RAM is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACU_EN</name>
              <description>ACU RAM RAM enable / disable.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_DIS</name>
                  <description>RAM is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_EN</name>
                  <description>RAM is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSB_EN</name>
              <description>Control Store RAM B RAM enable / disable.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_DIS</name>
                  <description>RAM is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_EN</name>
                  <description>RAM is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSA_EN</name>
              <description>Control Store RAM A RAM enable / disable.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_DIS</name>
                  <description>RAM is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_EN</name>
                  <description>RAM is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSM_EN</name>
              <description>FSM RAM RAM enable / disable.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_DIS</name>
                  <description>RAM is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_EN</name>
                  <description>RAM is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
