ryood/PSoC_5LP_DigitalFilter_Test/Filter_ADC_VDAC_poll_CQ_PSoC5LP_DDS.svd
        <register>
          <name>Filter_RAM_DIR_Register</name>
          <description>DFB RAM Direction Register. This register controls the DFB memory direction. These bits control if each RAM of this block is embedded to the DFB function or mapped in the system address space on the AHB bus. </description>
          <addressOffset>0x4000C78C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SNP_DABLE</name>
              <description>The CS and DP RAMs (optionally the FSM) have address snooping logic that watches for redundant back-to-back RD cycles and disables the RAM to conserve power. Writing a 1 to this bit disables this logic for all RAMs.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SNP_ENABLE</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SNP_DISABLE</name>
                  <description>Disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPB_DIR</name>
              <description>Datapath RAM B RAM Direction.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_DFB</name>
                  <description>DFB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_AHB</name>
                  <description>System Bus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPA_DIR</name>
              <description>Datapath RAM A RAM Direction.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_DFB</name>
                  <description>DFB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_AHB</name>
                  <description>System Bus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACU_DIR</name>
              <description>ACU RAM RAM Direction.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_DFB</name>
                  <description>DFB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_AHB</name>
                  <description>System Bus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSB_DIR</name>
              <description>Control Store RAM B RAM Direction.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_DFB</name>
                  <description>DFB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_AHB</name>
                  <description>System Bus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSA_DIR</name>
              <description>Control Store RAM B RAM Direction.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_DFB</name>
                  <description>DFB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_AHB</name>
                  <description>System Bus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSM_DIR</name>
              <description>FSM RAM RAM Direction.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAM_DFB</name>
                  <description>DFB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM_AHB</name>
                  <description>System Bus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_DFB_SEMA_Register</name>
          <description>DFB Semaphore Register</description>
          <addressOffset>0x4000C790</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SEMA_MASK</name>
              <description>These bits are used to mask writes to bits 2-0. They are write-only. If bit 4 is a 1 then the value on bit 0 will be written to SEM0, otherwise SEM0 will not be altered. Likewise for MASK1 and SEM1, and MASK2 and SEM2.</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <field>
              <name>SEMA</name>
              <description>These bits are used to pass semaphores between the DFB Controller and the System SW. Their definition is user defined. There is no HW implementing an arbitration methodology should both the System and Control access the same SEM bit at the same time.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_DSI_Control_Register</name>
          <description>DFB Global Cotrol Register</description>
          <addressOffset>0x4000C794</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>GBL2_OUT</name>
              <description>These bits are used to control what internal signals are mapped to the primary output signal dfb_globalo2.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEM2</name>
                  <description>Semaphore Bit 2. This is the same signal described in the DFB0_SEMA CSR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPSIGN</name>
                  <description>Datapath Sign. This signal asserts anytime the output of the ALU in the Datapath unit is negative. It will remain high for each cycle this condition is true.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPTHREASH</name>
                  <description>Datapath Threashold Crossed. This signal asserts anytime the threashold of 0 is crossed in the ALU when one of the following instructions is executing: TDECA, TSUBA, TSUBB, TADDABSA, TADDABSB. It will remain high for each cycle this condition is true.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPEQ</name>
                  <description>Datapath ALU=0. This signal asserts high when the output of the ALU in the Datapath unit equals 0 and one of the following ALU commands is executing: TDECA, TSUBA, TSUBB, TADDABSA, TADDABSB. It will remain high for each cycle this condition is true.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GBL1_OUT</name>
              <description>These bits are used to control what internal signals are mapped to the primary output signal dfb_globalo1.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFB_RUN</name>
                  <description>DFB RUN Bit. This is the same bit as the RUN bit in the DFB0_CR register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEM0</name>
                  <description>Semaphore Bit 0. This is the same signal described in the DFB0_SEMA CSR.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEM1</name>
                  <description>Semaphore Bit 1. This is the same signal described in the DFB0_SEMA CSR.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFB_INTR</name>
                  <description>DFB Interrupt. This is the same signal as the primary dfb_intr output signal.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_Interrupt_Control_Register</name>
          <description>DFB Interrupt Control Register</description>
          <addressOffset>0x4000C798</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SEMA2_EN</name>
              <description>If this bit is set high, an interrupt is generated each time a 1 is written into the semaphore register bit 2.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_SEMAPHORE_2_IRQ_DIS</name>
                  <description>Semaphore register interrupt masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_SEMAPHORE_2_IRQ_EN</name>
                  <description>Interrupt is generated each time a 1 is written to the semaphore register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMA1_EN</name>
              <description>If this bit is set high, an interrupt is generated each time a 1 is written into the semaphore register bit 1.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_SEMAPHORE_1_IRQ_DIS</name>
                  <description>Semaphore register interrupt masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_SEMAPHORE_1_IRQ_EN</name>
                  <description>Interrupt is generated each time a 1 is written to the semaphore register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEMA0_EN</name>
              <description>If this bit is set high, an interrupt is generated each time a 1 is written into the semaphore register bit 0.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_SEMAPHORE_0_IRQ_DIS</name>
                  <description>Semaphore register interrupt masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_SEMAPHORE_0_IRQ_EN</name>
                  <description>Interrupt is generated each time a 1 is written to the semaphore register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HOLDB_EN</name>
              <description>If this bit is set high, an interrupt is generated each time new valid data is written into the output Holding register B.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_HOLDING_B_IRQ_DIS</name>
                  <description>Holding register interrupt masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_HOLDING_B_IRQ_EN</name>
                  <description>Interrupt is generated each time new valid data is written inot the output Holding B register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HOLDA_EN</name>
              <description>If this bit is set high, an interrupt is generated each time new valid data is written into the output Holding register A.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_HOLDING_A_IRQ_DIS</name>
                  <description>Holding register interrupt masked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_HOLDING_A_IRQ_EN</name>
                  <description>Interrupt is generated each time new valid data is written inot the output Holding A register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_DMA_Control_Register</name>
          <description>DFB DMAREQ Control Register</description>
          <addressOffset>0x4000C79C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DMAREQ2</name>
              <description>The value in these two bits selects which event drives dma_req2.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAREQ2_DISABLED</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAREQ2_HOLDING_REG_B</name>
                  <description>New data in Holding Register B.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAREQ2_SEMAPHORE_0</name>
                  <description>Semaphore 0.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAREQ2_SEMAPHORE_1</name>
                  <description>Semaphore 1.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAREQ1</name>
              <description>The value in these two bits selects which event drives dma_req1.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAREQ1_DISABLED</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAREQ1_HOLDING_REG_A</name>
                  <description>New data in Holding Register A.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAREQ1_SEMAPHORE_0</name>
                  <description>Semaphore 0.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAREQ1_SEMAPHORE_1</name>
                  <description>Semaphore 1.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_STAGEA_Register</name>
          <description>DFB_STAGEA (Input Low Byte) Register</description>
          <addressOffset>0x4000C7A0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STGA_LOW</name>
              <description>This is the low byte of the Streaming input Staging Register - Port A.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_STAGEAM_Register</name>
          <description>DFB_STAGEAM (Input Middle Byte) Register</description>
          <addressOffset>0x4000C7A1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STGA_MID</name>
              <description>This is the middle byte of the Streaming input Staging Register - Port A.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_STAGEAH_Register</name>
          <description>DFB_STAGEAH (Input High Byte) Register</description>
          <addressOffset>0x4000C7A2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STGA_HIGH</name>
              <description>This is the high byte of the Streaming input Staging Register - Port A.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_STAGEB_Register</name>
          <description>DFB_STAGEB (Input Low Byte) Register</description>
          <addressOffset>0x4000C7A4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STGB_LOW</name>
              <description>This is the low byte of the Streaming input Staging Register - Port B.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_STAGEBM_Register</name>
          <description>DFB_STAGEBM (Input Middle Byte) Register</description>
          <addressOffset>0x4000C7A5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STGB_MID</name>
              <description>This is the middle byte of the Streaming input Staging Register - Port B.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_STAGEBH_Register</name>
          <description>DFB_STAGEBH (Input High Byte) Register</description>
          <addressOffset>0x4000C7A6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STGB_HIGH</name>
              <description>This is the high byte of the Streaming input Staging Register - Port B.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_HOLDA_Register</name>
          <description>DFB_HOLDA (Output Low Byte) Register</description>
          <addressOffset>0x4000C7A8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HOLDA_LOW</name>
              <description>This is the low byte of the output Holding Register - Port A.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_HOLDAM_Register</name>
          <description>DFB_HOLDAM (Output Middle Byte) Register</description>
          <addressOffset>0x4000C7A9</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HOLDA_MID</name>
              <description>This is the middle byte of the output Holding Register - Port A.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
