ryood/PSoC_5LP_DigitalFilter_Test/Filter_ADC_VDAC_poll_CQ_PSoC5LP_DDS.svd
        <register>
          <name>Filter_HOLDAH_Register</name>
          <description>DFB_HOLDAH (Output High Byte) Register</description>
          <addressOffset>0x4000C7AA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HOLDA_HIGH</name>
              <description>This is the high byte of the output Holding Register - Port A.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_HOLDB_Register</name>
          <description>DFB_HOLDB (Output Low Byte) Register</description>
          <addressOffset>0x4000C7AC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HOLDB_LOW</name>
              <description>This is the low byte of the output Holding Register - Port B.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_HOLDBM_Register</name>
          <description>DFB_HOLDBM (Output Middle Byte) Register</description>
          <addressOffset>0x4000C7AD</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HOLDB_MID</name>
              <description>This is the middle byte of the output Holding Register - Port B.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_HOLDBH_Register</name>
          <description>DFB_HOLDBH (Output High Byte) Register</description>
          <addressOffset>0x4000C7AE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HOLDB_HIGH</name>
              <description>This is the high byte of the output Holding Register - Port B.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_DFB_COHER_Register</name>
          <description>DFB Coherency Register</description>
          <addressOffset>0x4000C7B0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>holdb_key</name>
              <description>Sets the Key Coherency Byte of the Holding B register</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HOLDB_KEY_LOW</name>
                  <description>Key Byte is low byte.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLDB_KEY_MID</name>
                  <description>Key Byte is middle byte.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLDB_KEY_HIGH</name>
                  <description>Key Byte is high byte.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>holda_key</name>
              <description>Sets the Key Coherency Byte of the Holding A register</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HOLDA_KEY_LOW</name>
                  <description>Key Byte is low byte.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLDA_KEY_MID</name>
                  <description>Key Byte is middle byte.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLDA_KEY_HIGH</name>
                  <description>Key Byte is high byte.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>stgb_key</name>
              <description>Sets the Key Coherency Byte of the Staging B register.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STGB_KEY_LOW</name>
                  <description>Key Byte is low byte.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STGB_KEY_MID</name>
                  <description>Key Byte is middle byte.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STGB_KEY_HIGH</name>
                  <description>Key Byte is high byte.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>stga_key</name>
              <description>Sets the Key Coherency Byte of the Staging A register.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STGA_KEY_LOW</name>
                  <description>Key Byte is low byte.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STGA_KEY_MID</name>
                  <description>Key Byte is middle byte.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STGA_KEY_HIGH</name>
                  <description>Key Byte is high byte.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>Filter_DFB_DALIGN_Register</name>
          <description>DFB Data Align Register</description>
          <addressOffset>0x4000C7B4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>holdb_dalign</name>
              <description>Shifts the read right by a byte.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HOLDB_DALIGN_LOW</name>
                  <description>Reads normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLDB_DALIGN_HIGH</name>
                  <description>Reads shifted right by 8-bits.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>holda_dalign</name>
              <description>Shifts the read right by a byte.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HOLDA_DALIGN_LOW</name>
                  <description>Reads normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOLDA_DALIGN_HIGH</name>
                  <description>Reads shifted right by 8-bits.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>stgb_dalign</name>
              <description>Shifts the write left by a byte.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STGB_DALIGN_LOW</name>
                  <description>Writes normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STGB_DALIGN_HIGH</name>
                  <description>Writes shifted left by 8-bits.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>stga_dalign</name>
              <description>Shifts the write left by a byte.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STGA_DALIGN_LOW</name>
                  <description>Writes normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STGA_DALIGN_HIGH</name>
                  <description>Writes shifted left by 8-bits.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
